OpenFOAM/montana-v2106/run/shockTube/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1000;

vertices
(
    (-0.4 -0.2 -0.001)
    (0.4 -0.2 -0.001)
    (0.4 0.2 -0.001)
    (-0.4 0.2 -0.001)
    (-0.4 -0.2 0.001)
    (0.4 -0.2 0.001)
    (0.4 0.2 0.001)
    (-0.4 0.2 0.001)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (800 1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    left
    {
	type	patch;
        faces
        (
            (1 2 6 5)
        );
    }
    right
    {
	type	patch;
        faces
        (
            (0 4 7 3)
        );
    }
    empty
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (5 6 7 4)
            (3 7 6 2)
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
