OpenFOAM/montana-v2106/run/shockTube/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    left
    {
        type            patch;
        nFaces          1;
        startFace       799;
    }
    right
    {
        type            patch;
        nFaces          1;
        startFace       800;
    }
    empty
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3200;
        startFace       801;
    }
)

// ************************************************************************* //
